{
  "books": [
    {
      "title": "The Seven Husbands of Evelyn Hugo",
      "author": "Taylor Jenkins Reid",
      "cover_img": "https://m.media-amazon.com/images/I/81PjadeEG4L._SY466_.jpg",
      "bio": "Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now? Monique is not exactly on top of the world. Her husband has left her, and her professional life is going nowhere. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jumpstart her career. Summoned to Evelyn’s luxurious apartment, Monique listens in fascination as the actress tells her story. From making her way to Los Angeles in the 1950s to her decision to leave show business in the ‘80s, and, of course, the seven husbands along the way, Evelyn unspools a tale of ruthless ambition, unexpected friendship, and a great forbidden love. Monique begins to feel a very real connection to the legendary star, but as Evelyn’s story near its conclusion, it becomes clear that her life intersects with Monique’s own in tragic and irreversible ways.",
      "reviews": [
        "Riveting, heart-wrenching, and full of Old Hollywood glamour, The Seven Husbands of Evelyn Hugo is one of the most captivating reads of 2017. —BuzzFeed",
        "The epic adventures Evelyn creates over the course of a lifetime will leave every reader mesmerized. This wildly addictive journey of a reclusive Hollywood starlet and her tumultuous Tinseltown journey comes with unexpected twists and the most satisfying of drama. —PopSugar",
        "Heartbreaking, yet beautiful. —Jamie Blynn, Us Weekly",
        "Tinseltown drama at its finest. —Redbook"
      ],
      "isbn": "9781501139239",
      "publish_date": "06-13-2017",
      "star_rating": 4.6,
      "rating_count": 232279,
      "category": "Fiction",
      "other_info": "Publisher: Atria Books <br> First Edition: (June 13, 2017) <br> Language: English <br> Hardcover: 400 pages <br> Item Weight: 3.53 ounces <br> Dimensions: 6 x 1.3 x 9 inches<br> Best Sellers Rank:<br>#12,099 in Books <br> #542 in Family Life Fiction <br> #786 in Women's Domestic Life Fiction <br>#4,223 in Contemporary Romance<br>"
    },
    {
      "title": "Red, White & Royal Blue: A Novel",
      "author": "Casey McQuiston",
      "cover_img": "https://m.media-amazon.com/images/I/71skR7IaVEL._SY466_.jpg",
      "bio": "What happens when America's First Son falls in love with the Prince of Wales? When his mother became President, Alex Claremont-Diaz was promptly cast as the American equivalent of a young royal. Handsome, charismatic, genius—his image is pure millennial-marketing gold for the White House. There's only one problem: Alex has a beef with the actual prince, Henry, across the pond. And when the tabloids get hold of a photo involving an Alex-Henry altercation, U.S./British relations take a turn for the worse. Heads of family, state, and other handlers devise a plan for damage control: staging a truce between the two rivals. What at first begins as a fake, Instagramable friendship grows deeper, and more dangerous, than either Alex or Henry could have imagined. Soon Alex finds himself hurtling into a secret romance with a surprisingly unstuffy Henry that could derail the campaign and upend two nations and begs the question: Can love save the world after all?",
      "reviews": [
        "I took this with me wherever I went and stole every second I had to read! Absorbing, hilarious, tender, sexy—this book had everything I crave. I’m jealous of all the readers out there who still get to experience Red, White & Royal Blue for the first time! - Christina Lauren",
        "Red, White & Royal Blue is outrageously fun. It is romantic, sexy, witty, and thrilling. I loved every second. - Taylor Jenkins Reid"
      ],
      "isbn": "978-1250316776",
      "publish_date": "2019-05-14",
      "star_rating": 4.5,
      "rating_count": 57945,
      "category": "romance",
      "other_info": "Publisher: St. Martin's Griffin"
    },
    {
      "title": "We Are Only Ghosts: A Remarkable Novel of Survival in the Wake of WWII",
      "author": "Jeffrey L. Richards",
      "cover_img": "https://m.media-amazon.com/images/I/81DhenCfJLL._SY466_.jpg",
      "bio": "An exhilarating, brutally candid saga about sexuality and war, tenderness and trauma, young passion and fierce hate, as a teenage boy’s unexpected, complicated relationship with a Nazi officer in a WWII death camp is resurrected in 1960s New York City. We Are Only Ghosts depicts queer desire against the horrors of death camps and the psychosis of those who got out alive—haunted forever by those who did not—balancing the violence and hatred of war and its aftermath with many poignant moments of tenderness and joy. For readers of A Little Life by Hanya Yanagihara, The Heart's Invisible Furies by John Boyne, and Young Mungo by Douglas Stuart.",
      "reviews": [],
      "isbn": "978-1496742810",
      "publish_date": "2024-02-20",
      "star_rating": 4.4,
      "rating_count": 78,
      "category": "fiction",
      "other_info": "Publisher: A John Scognamiglio Book"
    },
    {
      "title": "They Both Die at the End",
      "author": "Adam Silvera",
      "cover_img": "https://m.media-amazon.com/images/I/81D-gdnku+L._SY466_.jpg",
      "bio": "Adam Silvera reminds us that there’s no life without death and no love without loss in this devastating yet uplifting story about two people whose lives change over the course of one unforgettable day. On September 5, a little after midnight, Death-Cast calls Mateo Torrez and Rufus Emeterio to give them some bad news: They’re going to die today. Mateo and Rufus are total strangers, but, for different reasons, they’re both looking to make a new friend on their End Day. The good news: There’s an app for that. It’s called the Last Friend, and through it, Rufus and Mateo are about to meet up for one last great adventure—to live a lifetime in a single day.",
      "reviews": [],
      "isbn": "978-0062457790",
      "publish_date": "2017-09-05",
      "star_rating": 4.6,
      "rating_count": 40398,
      "category": "fiction",
      "other_info": "Publisher: Quill Tree Books"
    },
    {
      "title": "Cemetery Boys",
      "author": "Aiden Thomas",
      "cover_img": "https://m.media-amazon.com/images/I/81zjwKmYg-L._SY466_.jpg",
      "bio": "A trans boy determined to prove his gender to his traditional Latinx family summons a ghost who refuses to leave in Aiden Thomas's paranormal YA debut Cemetery Boys. Yadriel has summoned a ghost, and now he can't get rid of him. When his traditional Latinx family has problems accepting his true gender, Yadriel becomes determined to prove himself a real brujo. With the help of his cousin and best friend Maritza, he performs the ritual himself, and then sets out to find the ghost of his murdered cousin and set it free. However, the ghost he summons is actually Julian Diaz, the school's resident bad boy, and Julian is not about to go quietly into death. He's determined to find out what happened and tie off some loose ends before he leaves. Left with no choice, Yadriel agrees to help Julian, so that they can both get what they want. But the longer Yadriel spends with Julian, the less he wants to let him leave.",
      "reviews": [],
      "isbn": "978-1250250469",
      "publish_date": "2020-09-01",
      "star_rating": 4.6,
      "rating_count": 4879,
      "category": "fantasy",
      "other_info": "Publisher: Swoon Reads; First American Edition"
    },
    {
      "title": "One Last Stop",
      "author": "Casey McQuiston",
      "cover_img": "https://m.media-amazon.com/images/I/7125eYIFBxL._SY466_.jpg",
      "bio": "From the New York Times bestselling author of Red, White & Royal Blue comes a new romantic comedy that will stop readers in their tracks. For cynical twenty-three-year-old August, moving to New York City is supposed to prove her right: that things like magic and cinematic love stories don’t exist, and the only smart way to go through life is alone. She can’t imagine how waiting tables at a 24-hour pancake diner and moving in with too many weird roommates could possibly change that. And there’s certainly no chance of her subway commute being anything more than a daily trudge through boredom and electrical failures. But then, there’s this gorgeous girl on the train. Jane. Dazzling, charming, mysterious, impossible Jane. Jane with her rough edges and swoopy hair and soft smile, showing up in a leather jacket to save August’s day when she needed it most. August’s subway crush becomes the best part of her day, but pretty soon, she discovers there’s one big problem: Jane doesn’t just look like an old school punk rocker. She’s literally displaced in time from the 1970s, and August is going to have to use everything she tried to leave in her own past to help her. Maybe it’s time to start believing in some things, after all.",
      "reviews": [],
      "isbn": "978-1250244499",
      "publish_date": "2021-06-01",
      "star_rating": 4.4,
      "rating_count": 10651,
      "category": "romance",
      "other_info": "Publisher: Griffin"
    },
    {
      "title": "In the Dream House: A Memoir",
      "author": "Carmen Maria Machado",
      "cover_img": "https://m.media-amazon.com/images/I/91zeicdP-gL._SY466_.jpg",
      "bio": "A revolutionary memoir about domestic abuse by the award-winning author of Her Body and Other Parties. In the Dream House is Carmen Maria Machado’s engrossing and wildly innovative account of a relationship gone bad, and a bold dissection of the mechanisms and cultural representations of psychological abuse. Tracing the full arc of a harrowing relationship with a charismatic but volatile woman, Machado struggles to make sense of how what happened to her shaped the person she was becoming. And it’s that struggle that gives the book its original structure: each chapter is driven by its own narrative trope—the haunted house, erotica, the bildungsroman—through which Machado holds the events up to the light and examines them from different angles.",
      "reviews": [],
      "isbn": "978-1644450031",
      "publish_date": "2019-11-05",
      "star_rating": 4.4,
      "rating_count": 6321,
      "category": "non-fiction",
      "other_info": "Publisher: Graywolf Press; First Edition"
    },
    {
      "title": "Felix Ever After",
      "author": "Kacen Callender",
      "cover_img": "https://m.media-amazon.com/images/I/91FclpIQfoL._SY466_.jpg",
      "bio": "From Stonewall and Lambda Award-winning author Kacen Callender comes a revelatory YA novel about a transgender teen grappling with identity and self-discovery while falling in love for the first time. Felix Love has never been in love—and, yes, he’s painfully aware of the irony. He desperately wants to know what it’s like and why it seems so easy for everyone but him to find someone. What’s worse is that, even though he is proud of his identity, Felix also secretly fears that he’s one marginalization too many—Black, queer, and transgender—to ever get his own happily-ever-after. When an anonymous student begins sending him transphobic messages—after publicly posting Felix’s deadname alongside images of him before he transitioned—Felix comes up with a plan for revenge. What he didn’t count on: his catfish scenario landing him in a quasi–love triangle.... But as he navigates his complicated feelings, Felix begins a journey of questioning and self-discovery that helps redefine his most important relationship: how he feels about himself.",
      "reviews": [],
      "isbn": "978-0062820259",
      "publish_date": "2020-05-05",
      "star_rating": 4.6,
      "rating_count": 2243,
      "category": "fiction",
      "other_info": "Publisher: Balzer + Bray"
    },
    {
      "title": "Loveless",
      "author": "Alice Oseman",
      "cover_img": "https://m.media-amazon.com/images/I/91nfJpSgsNL._SY466_.jpg",
      "bio": "From the marvelous author of Heartstopper comes an exceptional YA novel about discovering that it's okay if you don't have sexual or romantic feelings for anyone . . . since there are plenty of other ways to find love and connection. This is the funny, honest, messy, completely relatable story of Georgia, who doesn't understand why she can't crush and kiss and make out like her friends do. She's surrounded by the narrative that dating + sex = love. It's not until she gets to college that she discovers the A range of the LGBTQIA+ spectrum -- coming to understand herself as asexual/aromantic. Disrupting the narrative that she's been told since birth isn't easy -- there are many mistakes along the way to inviting people into a newly found articulation of an always-known part of your identity. But Georgia's determined to get her life right, with the help of (and despite the major drama of) her friends.",
      "reviews": [],
      "isbn": "978-1338751932",
      "publish_date": "2022-03-01",
      "star_rating": 4.6,
      "rating_count": 4019,
      "category": "fiction",
      "other_info": "Publisher: Scholastic Press"
    },
    {
      "title": "Boyfriend Material",
      "author": "Alexis Hall",
      "cover_img": "https://m.media-amazon.com/images/I/81zKg9e8EYL._SY466_.jpg",
      "bio": "Luc O'Donnell is tangentially—and reluctantly—famous. His rock star parents split when he was young, and the father he's never met spent the next twenty years cruising in and out of rehab. Now that his dad's making a comeback, Luc's back in the public eye, and one compromising photo is enough to ruin everything. To clean up his image, Luc has to find a nice, normal relationship…and Oliver Blackwood is as nice and normal as they come. He's a barrister, an ethical vegetarian, and he's never inspired a moment of scandal in his life. In other words: perfect boyfriend material. Unfortunately, apart from being gay, single, and really, really in need of a date for a big event, Luc and Oliver have nothing in common. So they strike a deal to be publicity-friendly (fake) boyfriends until the dust has settled. Then they can go their separate ways and pretend it never happened. But the thing about fake-dating is that it can feel a lot like real-dating. And that's when you get used to someone. Start falling for them. Don't ever want to let them go.",
      "reviews": [],
      "isbn": "978-1728206141",
      "publish_date": "2020-07-07",
      "star_rating": 4.5,
      "rating_count": 11542,
      "category": "romance",
      "other_info": "Publisher: Sourcebooks Casablanca; Illustrated edition"
    },
    {
      "title": "The House in the Cerulean Sea",
      "author": "TJ Klune",
      "cover_img": "https://m.media-amazon.com/images/I/81MnY8Q7OLL._SY466_.jpg",
      "bio": "Linus Baker is a by-the-book case worker in the Department in Charge of Magical Youth. He's tasked with determining whether six dangerous magical children are likely to bring about the end of the world. Arthur Parnassus is the master of the orphanage. He would do anything to keep the children safe, even if it means the world will burn. And his secrets will come to light. The House in the Cerulean Sea is an enchanting love story, masterfully told, about the profound experience of discovering an unlikely family in an unexpected place—and realizing that family is yours.",
      "reviews": [],
      "isbn": "978-1250217288",
      "publish_date": "2020-03-17",
      "star_rating": 4.6,
      "rating_count": 51930,
      "category": "fantasy",
      "other_info": "Publisher: Tor Books"
    },
    {
      "title": "This Is How It Always Is: A Novel",
      "author": "Laurie Frankel",
      "cover_img": "https://m.media-amazon.com/images/I/813djjL8MFL._SY466_.jpg",
      "bio": "This is Claude. He’s five years old, the youngest of five brothers, and loves peanut butter sandwiches. He also loves wearing a dress, and dreams of being a princess. When he grows up, Claude says, he wants to be a girl. Rosie and Penn want Claude to be whoever Claude wants to be. They’re just not sure they’re ready to share that with the world. Soon the entire family is keeping Claude’s secret. Until one day it explodes. Laurie Frankel's This Is How It Always Is is a novel about revelations, transformations, fairy tales, and family. And it’s about the ways this is how it always is: Change is always hard and miraculous and hard again, parenting is always a leap into the unknown with crossed fingers and full hearts, children grow but not always according to plan. And families with secrets don’t get to keep them forever.",
      "reviews": [],
      "isbn": "978-1250088550",
      "publish_date": "2017-01-24",
      "star_rating": 4.5,
      "rating_count": 39082,
      "category": "fiction",
      "other_info": "Publisher: Flatiron Books; First Edition"
    },
    {
      "title": "Detransition, Baby: A Novel",
      "author": "Torrey Peters",
      "cover_img": "https://m.media-amazon.com/images/I/81AfD7O2XYL._SY466_.jpg",
      "bio": "NATIONAL BESTSELLER. The lives of three women—transgender and cisgender—collide after an unexpected pregnancy forces them to confront their deepest desires in “one of the most celebrated novels of the year” (Time). Reese almost had it all: a loving relationship with Amy, an apartment in New York City, a job she didn't hate. She had scraped together what previous generations of trans women could only dream of: a life of mundane, bourgeois comforts. The only thing missing was a child. But then her girlfriend, Amy, detransitioned and became Ames, and everything fell apart. Now Reese is caught in a self-destructive pattern: avoiding her loneliness by sleeping with married men. Ames isn't happy either. He thought detransitioning to live as a man would make life easier, but that decision cost him his relationship with Reese—and losing her meant losing his only family. Even though their romance is over, he longs to find a way back to her. When Ames's boss and lover, Katrina, reveals that she's pregnant with his baby—and that she's not sure whether she wants to keep it—Ames wonders if this is the chance he's been waiting for. Could the three of them form some kind of unconventional family—and raise the baby together?",
      "reviews": [],
      "isbn": "978-0593133378",
      "publish_date": "2021-01-12",
      "star_rating": 4.2,
      "rating_count": 4829,
      "category": "fiction",
      "other_info": "Publisher: One World"
    },
    {
      "title": "The Mars House: A Novel",
      "author": "Natasha Pulley",
      "cover_img": "https://m.media-amazon.com/images/I/81ceF-xrZgL._SY466_.jpg",
      "bio": "A compulsively readable queer sci-fi novel about a marriage of convenience between a Mars politician and an Earth refugee. Named as one of Amazon's Best Books of 2024 So Far. As Recommended By: Amazon * LitHub * Gizmodo * New Scientist * LGBTQ Reads * Reactor Magazine * KOBO Canada * BookRiot. In the wake of an environmental catastrophe, January, once a principal in London's Royal Ballet, has become a refugee in Tharsis, the terraformed colony on Mars. There, January's life is dictated by his status as an Earthstronger - a person whose body is not adjusted to lower gravity and so poses a danger to those born on, or naturalized to, Mars. January's job choices, housing, and even transportation are dictated by this second-class status, and now a xenophobic politician named Aubrey Gale is running on a platform that would make it all worse: Gale wants all Earthstrongers to naturalize, a process that is always disabling and sometimes deadly. When Gale chooses January for an on-the-spot press junket interview that goes horribly awry, January's life is thrown into chaos, but Gale's political fortunes are damaged, too. Gale proposes a solution to both their problems: a five year made-for-the-press marriage that would secure January's future without naturalization and ensure Gale's political success. But when January accepts the offer, he discovers that Gale is not at all like they appear in the press. They're kind, compassionate, and much more difficult to hate than January would prefer. As their romantic relationship develops, the political situation worsens, and January discovers Gale has an enemy, someone willing to destroy all of Tharsis to make them pay - and January may be the only person standing in the way. Un-put-downably immersive and utterly timely, Natasha Pulley's new novel is a gripping story about privilege, strength, and life across class divisions, perfect for readers of Sarah Gailey and Tamsyn Muir.",
      "reviews": [
        "Un-put-downably immersive and utterly timely.",
        "A gripping story about privilege, strength, and life across class divisions."
      ],
      "isbn": "9781639732333",
      "publish_date": "2024-03-19",
      "star_rating": 4.6,
      "rating_count": 233,
      "category": "Fiction",
      "other_info": "Named one of Amazon's Best Books of 2024 So Far. As Recommended By: Amazon, LitHub, Gizmodo, New Scientist, LGBTQ Reads, Reactor Magazine, KOBO Canada, BookRiot."
    },
    {
      "title": "The Savvy Ally: A Guide for Becoming a Skilled LGBTQ+ Advocate",
      "author": "Jeannie Gainsburg",
      "cover_img": "https://m.media-amazon.com/images/I/71GopZ4aZDL._SY466_.jpg",
      "bio": "Bursting with passion and humor, The Savvy Ally: A Guide for Becoming a Skilled LGBTQ+ Advocate is a treasure trove for allies to the LGBTQ+ communities. This fully revised second edition includes: * The most current information on identities and LGBTQ+ language * Tips for respectfully sharing, gathering, and using pronouns * LGBTQ+ etiquette, including common language bloopers to avoid * Tools for navigating difficult conversations * Best practices for creating LGBTQ+ inclusive spaces * Appropriate actions to take after messing up * Techniques for self-care and sustainable allyship. The Savvy Ally is a vital resource for teachers, mental health professionals, healthcare providers, college professors, faith leaders, family members, and friends who want to support and advocate for the LGBTQ+ people in their lives and help make the world a safer, more inclusive place. This informative, encouraging, and easy-to-understand guidebook will jump-start even the most tentative ally. 100% of the royalties from the first year of sales of this 2nd edition will be donated to nonprofit organizations working to build a safer and more inclusive world for LGBTQ+ people.",
      "reviews": [
        "This is it. You found it—the very best guide on how not to make mistakes with LGBTQ+ employees, customers, students, congregants, patients, and family members. If you want to be an effective ally for LGBTQ+ people, buy and read The Savvy Ally. I very enthusiastically endorse this book.",
        "This is a beautiful book. A necessary book. An unputdownable book. Please read this book."
      ],
      "isbn": "978-1538169230",
      "publish_date": "2023-03-31",
      "star_rating": 4.9,
      "rating_count": 58,
      "category": "non-fiction",
      "other_info": "Publisher: Rowman & Littlefield Publishers; Second edition"
    },
    {
      "title": "The T in LGBT: Everything You Need to Know About Being Trans",
      "author": "Jamie Raines",
      "cover_img": "https://m.media-amazon.com/images/I/71NcpJ-CifL._SY466_.jpg",
      "bio": "A practical and highly accessible guide for those navigating society as a trans person or trying to gain understanding of the trans experience, from psychologist, content creator, and LGBTQ+ advocate Jamie Raines, with over one million YouTube subscribers. Hey, I'm Jamie, a 29-year-old trans guy from the UK. I've been transitioning for 12 years now after realizing I was trans (by accident!) at sixteen years old. I knew I was a boy since the age of four, but realized while growing up that I was different. It was only in my teens that I found the words to express who I was and what I needed to do. Since then, I've been on testosterone for more than a decade. I've also had top and bottom surgery and legally changed my sex, so I know a few things about the transitioning process and being trans! I want to welcome you to The T in LGBT where you can explore and learn about so many topics surrounding gender identity: realizing you're trans, starting hormones, considering surgery, and everything in between. Whether you're questioning your own identity and are looking for advice on certain stages of transition, or whether you're wanting to learn about the trans experience to support someone or understand allyship, I hope this book can be your one-stop guide to everything trans related. And don't just take my word for it either; this book is packed full of advice, tips, and the personal stories of a range of trans voices, because no one journey is the same.",
      "reviews": [
        "This book is packed full of advice, tips, and the personal stories of a range of trans voices, because no one journey is the same."
      ],
      "isbn": "978-1464220852",
      "publish_date": "2024-05-07",
      "star_rating": 4.8,
      "rating_count": 147,
      "category": "non-fiction",
      "other_info": "Publisher: Sourcebooks"
    },
    {
      "title": "To Kill A Cockroach",
      "author": "Osvaldo Calixto Amador",
      "cover_img": "https://m.media-amazon.com/images/I/51Thco+F7gL._SY466_.jpg",
      "bio": "\"... in the movie (and the novel) To Kill a Mockingbird, the father's character, Atticus Finch, tells his children that they can shoot all kinds of birds, but never a mockingbird, because the mockingbird does not harm anything dedicating himself to singing. Based on that anecdote, Osvaldo Calixto Amador recreates his life in Killing a Cockroach. This memoir is marked by the Cuban Revolution, exile, the discovery of his homosexuality, the devastation of AIDS ...and the search for self-love and artistic expression. Intense and full of emotion, this autobiography of a man and an artist will captivate the reader with its message of hope, improvement, and celebration of existence despite all obstacles. A vivid book...\"",
      "reviews": [
        "Great new queer story. I'm always looking for new gay writers, and this one is very talented. Beautifully written. I love the allusions to the inspiration. Solidly written. I enjoyed it.",
        "A very engaging book! I really enjoyed reading this book! It's a well-written memoir that deftly describes personal struggles and victories."
      ],
      "isbn": "978-0615675794",
      "publish_date": "2024-01-27",
      "star_rating": 4.9,
      "rating_count": 59,
      "category": "non-fiction",
      "other_info": "Publisher: Osvaldo C. Amador"
    },
    {
      "title": "The Ones We Burn",
      "author": "Rebecca Mix",
      "cover_img": "https://m.media-amazon.com/images/I/81Ub2u-ezYL._SY466_.jpg",
      "bio": "Love and duty collide in this richly imagined young adult debut about a witch whose dark powers put her at the center of a brewing war between the only family she’s ever known and the enemy who makes her question everything. Monster. Butcher. Bloodwinn. Ranka is tired of death. All she wants is to be left alone, living out her days in Witchik’s wild north with the coven that raised her, attempting to forget the horrors of her past. But when she is named Bloodwinn, the next treaty bride to the human kingdom of Isodal, her coven sends her south with a single directive: kill him. Easy enough, for a blood-witch whose magic compels her to kill. Except the prince is gentle, kind, and terrified of her. He doesn’t want to marry Ranka; he doesn’t want to be king at all. And it’s his sister—the wickedly smart, infuriatingly beautiful Princess Aramis—who seems to be the real threat. But when witches start turning up dead, murdered by a mysterious, magical plague, Aramis makes Ranka an offer: help her develop a cure, and in return, she’ll help Ranka learn to contain her deadly magic. As the coup draws nearer and the plague spreads, Ranka is forced to question everything she thought she knew about her power, her past, and who she’s meant to fight for. Soon, she will have to decide between the coven that raised her and the princess who sees beyond the monster they shaped her to be. But as the bodies pile up, a monster may be exactly what they need.",
      "reviews": [
        "An instant New York Times bestseller! A romantic, swashbuckling tale from start to finish."
      ],
      "isbn": "978-1534493513",
      "publish_date": "2022-11-01",
      "star_rating": 4.5,
      "rating_count": 271,
      "category": "fantasy",
      "other_info": "Publisher: Margaret K. McElderry Books"
    },
    {
      "title": "Conventionally Yours: An LGBTQIA Rivals-to-Lovers Road Trip Romance",
      "author": "Annabeth Albert",
      "cover_img": "https://m.media-amazon.com/images/I/61nDpEwQ9rL._SY466_.jpg",
      "bio": "When two sworn enemies go head-to-head in this charming LGBTQIA romance, love isn't the only thing at stake. Charming, charismatic, and effortlessly popular, Conrad Stewart seems to have it all…but in reality, he's scrambling to keep his life from tumbling out of control. Brilliant, guarded, and endlessly driven, Alden Roth may as well be the poster boy for perfection…but even he can't help but feel a little broken inside. When these mortal enemies are stuck together on a cross-country road trip to the biggest fan convention of their lives, their infamous rivalry takes a back seat as an unexpected connection is forged. Yet each has a reason why they have to win the upcoming gaming tournament and neither is willing to let emotion get in the way—even if it means giving up their one chance at something truly magical.",
      "reviews": [
        "Sweet, emotional, and uniquely quirky.",
        "You will ship this couple well before they figure out how much they need each other.",
        "Fast, funny, and fantastic. A quest for the new decade—gamers will love this."
      ],
      "isbn": "978-1728200293",
      "publish_date": "2020-06-02",
      "star_rating": 4.4,
      "rating_count": 1973,
      "category": "romance",
      "other_info": "Publisher: Sourcebooks Casablanca; Illustrated edition"
    },
    {
      "title": "The Secret Lives of Country Gentlemen",
      "author": "KJ Charles",
      "cover_img": "https://m.media-amazon.com/images/I/81UnrdPsdrL._SY466_.jpg",
      "bio": "Gothic scandal meets Bridgerton intrigue in this swashbuckling Regency romance from celebrated author KJ Charles. Abandoned by his father, Gareth Inglis grew up lonely, prickly, and well-used to disappointment. Still, he longs for a connection. When he meets a charming stranger, he falls head over heels—until everything goes wrong and he's left alone again. Then Gareth's father dies, turning the shabby London clerk into Sir Gareth, with a grand house on the remote Romney Marsh and a family he doesn't know. The Marsh is another world, a strange, empty place notorious for its ruthless gangs of smugglers. And one of them is dangerously familiar… Joss Doomsday has run the Doomsday smuggling clan since he was a boy. When the new baronet—his old lover—agrees to testify against Joss's sister, Joss acts fast to stop him. Their reunion is anything but happy, yet after the dust settles, neither can stay away. Soon, all Joss and Gareth want is the chance to be together. But the bleak, bare Marsh holds deadly secrets. And when Gareth finds himself threatened from every side, the gentleman and the smuggler must trust one another not just with their hearts, but with their lives.",
      "reviews": [
        "KJ Charles is one of the best romance novelists writing today. Historical romance at its finest.",
        "Once again KJ Charles has produced an absolute masterpiece!",
        "A romantic, swashbuckling tale from start to finish."
      ],
      "isbn": "978-1728255859",
      "publish_date": "2023-03-07",
      "star_rating": 4.6,
      "rating_count": 1529,
      "category": "mystery",
      "other_info": "Publisher: Sourcebooks Casablanca"
    },
    {
      "title": "Hoodoo House",
      "author": "Peter E. Fenton",
      "cover_img": "https://m.media-amazon.com/images/I/71Y+xqtbTHL._SY466_.jpg",
      "bio": "How far would you be willing to go to keep a secret? When writer Malcolm Tull is discovered dead at his writing desk, all signs point to suicide. But Malcolm’s editor isn’t so sure. There’s the matter of the man’s missing computer, a mislaid manuscript and the fact that he didn’t seem the type to take his own life. Declan Hunt and Charlie Watts are called into action and make their way to the mysterious Hoodoo House nestled on the edge of the Badlands of Alberta. Soon they are embroiled in a case involving blackmail, gay tricks and possibly even murder. As the secrets of Hoodoo House come to light, Charlie discovers that his boss has been keeping a few secrets of his own, secrets that could impact their romantic relationship outside of the office. And before this investigation is done, Charlie will have to get to the truth, even if it means this might be his final case for Declan Hunt Investigations.",
      "reviews": [],
      "isbn": "978-1802507324",
      "publish_date": "2024-06-25",
      "star_rating": 4.6,
      "rating_count": 64,
      "category": "mystery",
      "other_info": "Publisher: Pride Publishing"
    },
    {
      "title": "Love Kills",
      "author": "Ricky Johnston",
      "cover_img": "https://m.media-amazon.com/images/I/51DG8Gf+yYL._SY466_.jpg",
      "bio": "This is the story of two men who fall deeply in love with each other. But as their love blossoms, there's something sinister lurking in the shadows. Is it a stalker? A deranged killer? Come along on this journey filled with darkness and uncertainty.",
      "reviews": [
        "Unexpected ending. This book had me hooked, lots of twists I didn't expect that ending at all and normally I can work out the ending of horror films and books so it was refreshing to have an unpredictable ending.",
        "Great book. Love Kills: Fantastic really enjoyed reading this book. Not the usual ending has a twist to it. Well done Ricky."
      ],
      "isbn": "979-8327487864",
      "publish_date": "2024-06-25",
      "star_rating": 4.4,
      "rating_count": 7,
      "category": "mystery",
      "other_info": "Publisher: Independently published"
    },
    {
      "title": "Mann Hunt",
      "author": "Peter E. Fenton",
      "cover_img": "https://m.media-amazon.com/images/I/81rVG2SBQ-L._SY466_.jpg",
      "bio": "FROM POPULAR AUTHOR OF LGBTQIA ROMANCE FICTION PETER E. FENTON Book one in the Declan Hunt Mysteries series How far would you be willing to go to finish the job? Declan Hunt is having a bad week. His kidnapping case is showing little progress, his office assistant has left him on short notice, and his latest investigation has left him literally battered and bruised. But things change when he hires twenty-four year old Charlie Watts to help out at the office. They form an unlikely partnership trying to solve two seemingly unrelated cases whose threads begin to weave together when the missing person case turns to murder. The investigation takes them from the dark alleys, gay bars and bath houses of Calgary, to the richest parts of the city during the world-famous Calgary Stampede. But will they be able to discover who the killer is before another life is lost? And will Declan be able to solve the mystery of his relationship with Charlie who is clearly attracted to him — especially since it is evident that the attraction is becoming mutual?",
      "reviews": [],
      "isbn": "978-1802505610",
      "publish_date": "2023-08-29",
      "star_rating": 4.5,
      "rating_count": 308,
      "category": "mystery",
      "other_info": "Publisher: Pride Publishing"
    },
    {
      "title": "These Fragile Graces, This Fugitive Heart",
      "author": "Izzy Wasserstein",
      "cover_img": "https://m.media-amazon.com/images/I/914dJAi+g+L._SY466_.jpg",
      "bio": "A Publishers Weekly Selection: Spring 2024 Top-10 SF Fantasy and Horror. In a queer, noir technothriller of fractured identity and corporate intrigue, a trans woman faces her fear of losing her community as her past chases after her. This bold, thought-provoking debut science-fiction novella from a Lambda Award finalist is an exciting and unpredictable look at the fluid nature of our former and present selves. With a complex and enjoyably flawed trans protagonist and a portrayal of queer life that goes deeper than casual representation, this marks Wasserstein as a voice to watch out for in LGBTQ science fiction. In mid-21st-century Kansas City, Dora hasn’t been back to her old commune in years. But when Dora’s ex-girlfriend Kay is killed, and everyone at the commune is a potential suspect, Dora knows she’s the only person who can solve the murder. As Dora is dragged back into her old community and begins her investigations, she discovers that Kay’s death is only one of several terrible incidents. A strange new drug is circulating. People are disappearing. And Dora is being attacked by assailants from her pre-transition past. Meanwhile, It seems like a war between two nefarious corporations is looming, and Dora’s old neighborhood is their battleground. Now she must uncover a twisted conspiracy, all while navigating a deeply meaningful new relationship.",
      "reviews": [],
      "isbn": "978-1616964122",
      "publish_date": "2024-03-12",
      "star_rating": 4.3,
      "rating_count": 9,
      "category": "fantasy",
      "other_info": "Publisher: Tachyon Publications"
    }
  ]
}
